#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_bastion_host.bastion will be created
  + resource "azurerm_bastion_host" "bastion" {
      + dns_name            = (known after apply)
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = "debionbastion"
      + resource_group_name = "disneydemo2"

      + ip_configuration {
          + name                 = "configuration"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # azurerm_linux_virtual_machine.vm will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = true
      + id                              = (known after apply)
      + location                        = "westus2"
      + max_bid_price                   = -1
      + name                            = "debianvm"
      + network_interface_ids           = (known after apply)
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "disneydemo2"
      + size                            = "Standard_D2S_v3"
      + virtual_machine_id              = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "debian-10"
          + publisher = "Debian"
          + sku       = "10"
          + version   = "latest"
        }
    }

  # azurerm_network_ddos_protection_plan.demo will be created
  + resource "azurerm_network_ddos_protection_plan" "demo" {
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = "ddospplan1"
      + resource_group_name = "disneydemo2"
      + virtual_network_ids = (known after apply)
    }

  # azurerm_network_interface.vm will be created
  + resource "azurerm_network_interface" "vm" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westus2"
      + mac_address                   = (known after apply)
      + name                          = "vm-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "disneydemo2"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + name                          = "internal"
          + primary                       = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "dynamic"
          + private_ip_address_version    = "IPv4"
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_public_ip.bastion will be created
  + resource "azurerm_public_ip" "bastion" {
      + allocation_method       = "Static"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westus2"
      + name                    = "vmpip"
      + resource_group_name     = "disneydemo2"
      + sku                     = "Standard"
    }

  # azurerm_resource_group.demo will be created
  + resource "azurerm_resource_group" "demo" {
      + id       = (known after apply)
      + location = "westus2"
      + name     = "disneydemo2"
    }

  # azurerm_subnet.bastion will be created
  + resource "azurerm_subnet" "bastion" {
      + address_prefix                                 = "10.1.1.0/27"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + resource_group_name                            = "disneydemo2"
      + virtual_network_name                           = "vmvnet"
    }

  # azurerm_virtual_network_peering.aks will be created
  + resource "azurerm_virtual_network_peering" "aks" {
      + allow_forwarded_traffic      = (known after apply)
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "akstovm"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "disneydemo2"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "AKSVNet"
    }

  # azurerm_virtual_network_peering.vm will be created
  + resource "azurerm_virtual_network_peering" "vm" {
      + allow_forwarded_traffic      = (known after apply)
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "vmtoaks"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "disneydemo2"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "vmvnet"
    }

  # module.VNet-aks.azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = "10.0.0.0/22"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "AKSsubnet"
      + resource_group_name                            = "disneydemo2"
      + virtual_network_name                           = "AKSVNet"
    }

  # module.VNet-aks.azurerm_virtual_network.virtual_network will be created
  + resource "azurerm_virtual_network" "virtual_network" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = "AKSVNet"
      + resource_group_name = "disneydemo2"
      + tags                = {
          + "environment" = "prod"
        }

      + ddos_protection_plan {
          + enable = true
          + id     = (known after apply)
        }

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

  # module.VNet-vm.azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = "10.1.0.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "vmsubnet"
      + resource_group_name                            = "disneydemo2"
      + virtual_network_name                           = "vmvnet"
    }

  # module.VNet-vm.azurerm_virtual_network.virtual_network will be created
  + resource "azurerm_virtual_network" "virtual_network" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = "vmvnet"
      + resource_group_name = "disneydemo2"
      + tags                = {
          + "environment" = "prod"
        }

      + ddos_protection_plan {
          + enable = true
          + id     = (known after apply)
        }

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

  # module.aks-1.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + dns_prefix              = "aksdemoapril-dns"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + kube_admin_config       = (known after apply)
      + kube_admin_config_raw   = (sensitive value)
      + kube_config             = (known after apply)
      + kube_config_raw         = (sensitive value)
      + kubelet_identity        = (known after apply)
      + kubernetes_version      = "1.16.7"
      + location                = "westus2"
      + name                    = "aksdemoapril"
      + node_resource_group     = (known after apply)
      + private_cluster_enabled = (known after apply)
      + private_fqdn            = (known after apply)
      + private_link_enabled    = (known after apply)
      + resource_group_name     = "disneydemo2"

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
            }
        }

      + default_node_pool {
          + enable_auto_scaling = true
          + max_count           = 10
          + max_pods            = 50
          + min_count           = 1
          + name                = "default"
          + node_count          = 3
          + os_disk_size_gb     = (known after apply)
          + type                = "VirtualMachineScaleSets"
          + vm_size             = "Standard_D2s_v3"
          + vnet_subnet_id      = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + dns_service_ip     = "192.168.0.10"
          + docker_bridge_cidr = "172.17.0.1/16"
          + load_balancer_sku  = "Standard"
          + network_plugin     = "azure"
          + network_policy     = "azure"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = "192.168.0.0/16"

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + client_app_id     = (known after apply)
              + server_app_id     = (known after apply)
              + server_app_secret = (sensitive value)
              + tenant_id         = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./terraform`, Workspace: `default`*
